app/views/users/index.html.erb

        <h4><b><%= link_to user.username, user_path(user) %></b></h4>
        <small><%= pluralize(user.rentals.count, "rentals") if user.rentals %></small>
---
SELECT COUNT(*) FROM "rentals" WHERE "rentals"."user_id" = ?  [["user_id", 2]]