app/views/rentals/_form.html.erb

SELECT "categories".* FROM "categories"
---
<br>
    <%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>