app/views/rentals/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "rental_categories" ON "categories"."id" = "rental_categories"."category_id" WHERE "rental_categories"."rental_id" = ?  [["rental_id", 8]]
SELECT 1 AS one FROM "categories" INNER JOIN "rental_categories" ON "categories"."id" = "rental_categories"."category_id" WHERE "rental_categories"."rental_id" = ? LIMIT ?  [["rental_id", 8], ["LIMIT", 1]]
---

<% if @rental.categories.any? %>