app/views/pages/index.html.erb

<i class="fab fa-twitter fa-2x"></i>
<% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"