app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "bedsitter new"], ["updated_at", "2020-05-19 17:43:31.970046"], ["id", 1]]
---
    def update
        @category = Category.find(params[:id])
        if @category.update_attributes(category_params)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 9]]
---
    def destroy
        @category = Category.find(params[:id])
        if @category.destroy