app/controllers/rentals_controller.rb

SELECT "rentals".* FROM "rentals" WHERE (LOWER(title) LIKE '%eldoret' OR LOWER(description) LIKE '%eldoret')
---
  def index
    @rentals = Rental.all

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def edit
    @rental = Rental.find(params[:id])

INSERT INTO "rentals" ("title", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Los Blancos Estate"], ["description", "los blancos estate!!"], ["created_at", "2020-05-17 21:30:41.564759"], ["updated_at", "2020-05-17 21:30:41.564759"], ["user_id", 14]]
---
  def create
    @rental =Rental.new(rental_params)
    @rental.user = current_user
      if @rental.save

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
  def show
    @rental = Rental.find(params[:id])

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "rentals" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "rentals"."id" = ?  [["title", "Marisa apartments"], ["description", "marisa provides a nice and serene work and play environment"], ["updated_at", "2020-05-22 07:40:22.696498"], ["id", 14]]
---
  def update
    @rental = Rental.find(params[:id])
    if @rental.update_attributes(rental_params)

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "rentals" WHERE "rentals"."id" = ?  [["id", 7]]
---
  def destroy
    @rental = Rental.find(params[:id])
    @rental.destroy

SELECT "rentals".* FROM "rentals" WHERE "rentals"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def set_rental
    @rental = Rental.find(params[:id])