app/controllers/rentals_controller.rb

  def create
    @rental =Rental.new(rental_params)
    @rental.user = User.last
---
SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]