app/views/categories/index.html.erb

  <div class="p-4">
    <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"

        <h4><b><%= link_to category.name, category_path(category) %></b></h4>
        <small><%= pluralize(category.rentals.count, "rentals") %></small>
---
SELECT COUNT(*) FROM "rentals" INNER JOIN "rental_categories" ON "rentals"."id" = "rental_categories"."rental_id" WHERE "rental_categories"."category_id" = ?  [["category_id", 1]]